[
  {
    "text": "A ward nurse, angry that a patient repeatedly refused physiotherapy, removed the patient-controlled analgesia handset and told the patient they would 'learn to cope without it.' The patient was left in uncontrolled pain for hours.",
    "options": [
      "Verbal warning and communication skills training.",
      "Temporary redeployment and mediation with the patient.",
      "Immediate suspension, safeguarding referral, and report to the NMC; consider police referral.",
      "Reflective practice essay and return to supervised duties."
    ],
    "correctIndex": 2,
    "note": "Intentional withholding of prescribed analgesia to cause suffering. This meets the deliberate harm threshold; urgent protective action and regulatory escalation are indicated."
  },
  {
    "text": "A healthcare assistant took a humiliating photo of a sedated patient and shared it in a group chat with derogatory comments. The patient later learned of the photo and was distressed.",
    "options": [
      "Issue a written apology and require social-media training.",
      "Dismiss for abuse and humiliation, inform safeguarding, and notify the employer’s regulator/DBS route.",
      "One-week suspension without investigation to make a point.",
      "Redeploy for three months and close the case."
    ],
    "correctIndex": 1,
    "note": "Deliberate humiliation of a vulnerable patient. Gross misconduct with safeguarding and regulatory implications."
  },
  {
    "text": "An on-call doctor, angered by a relative’s complaint, deliberately delayed prescribing antiemetics for the relative’s family member, stating privately that 'they can wait.' The patient vomited repeatedly and aspirated, requiring critical care.",
    "options": [
      "Initiate dismissal proceedings and refer to the GMC; consider police if appropriate.",
      "Issue a formal warning and require customer-care training.",
      "Arrange mediation and return to normal duties.",
      "Occupational health referral only."
    ],
    "correctIndex": 0,
    "note": "Malicious withholding of treatment with intent to harm. Immediate disciplinary and regulatory pathways are required."
  },
  {
    "text": "A night registrar made multiple prescribing slips. Occupational health later confirmed severe undiagnosed obstructive sleep apnoea causing microsleeps. This was previously unknown to the registrar and team.",
    "options": [
      "Dismiss for incompetence due to repeated errors.",
      "Refer to occupational health, place temporary practice restrictions, and monitor treatment response.",
      "No action as the condition explains everything.",
      "Report to police for endangering patients."
    ],
    "correctIndex": 1,
    "note": "Previously unknown medical condition plausibly contributed. Prioritise health management and reasonable adjustments over punishment."
  },
  {
    "text": "An insulin-dependent surgeon felt early hypoglycaemia but continued with an elective list without informing colleagues. Intra-op judgement errors occurred. The surgeon had been advised to stop and treat if symptoms arose.",
    "options": [
      "Suspend from clinical duties, refer to occupational health and the GMC, and assess fitness to practice.",
      "Provide a verbal reminder only.",
      "No action if the patient came to no lasting harm.",
      "Immediate dismissal without investigation."
    ],
    "correctIndex": 0,
    "note": "Known medical condition with explicit safety plan ignored. This is an unacceptable risk; restriction and regulatory involvement are warranted."
  },
  {
    "text": "A paramedic attended duty after using cocaine recreationally the previous night and showed impaired judgement on scene. This is the first recorded incident; the paramedic admits use.",
    "options": [
      "Suspend immediately, refer to occupational health and the HCPC, and consider police referral per local policy.",
      "Allow practice with weekly supervision only.",
      "Issue a written apology to the patient and close the case.",
      "Grant sick leave with no further steps."
    ],
    "correctIndex": 0,
    "note": "Acute substance misuse with patient-safety impact. Urgent protective measures and regulatory notification are required."
  },
  {
    "text": "A nurse administered insulin without a second independent check despite a clear, workable, routinely used double-check protocol. The dose was tenfold and the patient required ICU.",
    "options": [
      "Verbal reminder only because workload was high.",
      "Occupational health referral only.",
      "No action; errors happen.",
      "Suspend and refer to the NMC pending investigation for unacceptable protocol violation."
    ],
    "correctIndex": 3,
    "note": "Protocol existed, was accessible, and in routine use. The nurse departed from it and took an unacceptable risk."
  },
  {
    "text": "During a busy take, a junior doctor skipped the allergy check documented in an available admission protocol. An antibiotic on the red-banner list was given and caused anaphylaxis, from which the patient recovered.",
    "options": [
      "Offer resilience training and no record kept.",
      "No action because the patient recovered.",
      "Issue a formal performance plan with restriction from prescribing pending training; notify GMC if pattern or severity warrants.",
      "Immediate dismissal without investigation."
    ],
    "correctIndex": 2,
    "note": "Clear departure from a known, workable protocol with high risk. Proportionate restriction and formal management are appropriate."
  },
  {
    "text": "A theatre lead insisted on skipping the WHO 'time-out' to save time. No equipment failure or ambiguity existed. Wrong implant selection was narrowly averted by a scrub nurse.",
    "options": [
      "Verbal nudge to follow the checklist next time.",
      "Team training only with no action against the lead.",
      "Suspend pending investigation, initiate disciplinary action, and report to the relevant regulator.",
      "Rotate the lead to another list without documentation."
    ],
    "correctIndex": 2,
    "note": "Knowingly ignoring a core safety checklist constitutes unacceptable risk. Suspension and formal action are justified."
  },
  {
    "text": "In a remote clinic with no paediatric airway kit, a GP used an improvised airway maneuver to maintain a child’s airway while waiting for retrieval. The local guideline covered adult equipment only.",
    "options": [
      "Disciplinary action for not following a non-existent paediatric protocol.",
      "No individual sanction; document learning, update protocols, and arrange targeted training.",
      "Report to GMC for scope-of-practice breach.",
      "Mandatory leave for two weeks without investigation."
    ],
    "correctIndex": 1,
    "note": "Protocols were inadequate for the context. A reasonable peer may have acted similarly. Address system gaps and provide support."
  },
  {
    "text": "After a major EHR update, the allergy banner displayed in a collapsed panel. Several clinicians missed it in the first 48 hours. A pharmacist caught a near-miss; one junior had already prescribed a contraindicated drug.",
    "options": [
      "Treat as a system design and rollout failure; issue an urgent safety notice, add interim checks, and train staff.",
      "Suspend the junior prescriber.",
      "Do nothing because the pharmacist caught it.",
      "Write final warnings for all staff who missed the banner."
    ],
    "correctIndex": 0,
    "note": "Protocol visibility was impaired and not in routine use post-change. A peer could reasonably miss it; fix the system and brief teams."
  },
  {
    "text": "A community midwife chose home monitoring over hospital admission for borderline pre-eclampsia in line with an ambiguous local pathway that lacks clear thresholds. Senior review later disagreed.",
    "options": [
      "Immediate disciplinary action for unsafe decision-making.",
      "No individual sanction; clarify the pathway, deliver update training, and set a senior-review trigger until fixed.",
      "Refer to the NMC automatically.",
      "Ignore because the baby was delivered safely."
    ],
    "correctIndex": 1,
    "note": "Where guidance is ambiguous, the Substitution Test often indicates peers might act similarly. Prioritise pathway clarity and support."
  },
  {
    "text": "Two wards used different versions of the sepsis protocol because the intranet link pointed to an old PDF. A nurse followed the outdated bundle and escalation was delayed.",
    "options": [
      "Final written warning for the nurse.",
      "Treat as system failure: fix document control, standardise links, brief all staff, and provide supportive refresher training.",
      "Suspend the ward sister for poor oversight.",
      "Report the nurse to the NMC for protocol breach."
    ],
    "correctIndex": 1,
    "note": "Version control failure. Focus on system correction, communication, and non-punitive education."
  },
  {
    "text": "Label printers intermittently swapped patient identifiers when the network dropped. Despite usual bedside checks, one mislabelled sample went unnoticed and a transfusion was delayed.",
    "options": [
      "Discipline the phlebotomist for not double-checking.",
      "No action if no harm occurred.",
      "Retrain only the night shift involved.",
      "Escalate as a system defect: pause affected devices, implement manual verification, investigate IT, and support staff."
    ],
    "correctIndex": 3,
    "note": "Latent IT failure contributed. Address the technology and process; avoid blame while reinforcing interim safety checks."
  },
  {
    "text": "On a night with multiple emergencies, staffing fell to 50% of the safe roster. Routine observations were missed and a patient deteriorated unnoticed for an hour.",
    "options": [
      "Write up the nurse in charge for negligence.",
      "Treat as a staffing and workload system failure: document the exception, institute escalation thresholds, and review safe-staffing plans; provide support to the team.",
      "Suspend all staff on duty pending investigation.",
      "Do nothing as pressures are expected."
    ],
    "correctIndex": 1,
    "note": "Latent system conditions and workload led to missed care. Focus on organisational fixes and staff support."
  }
]
