[
  {
    "text": "A ward nurse, angry that a patient repeatedly refused physiotherapy, removed the patient-controlled analgesia handset and told the patient they would 'learn to cope without it.' The patient was left in uncontrolled pain for hours.",
    "options": [
      "Issue a verbal warning with mandatory communication skills training and a scheduled reflective review.",
      "Arrange temporary redeployment with documented mediation with the patient and no formal escalation.",
      "Immediate suspension, safeguarding referral, report to the NMC and consider police referral.",
      "Require a reflective practice essay and a short period of supervised duties before normal practice."
    ],
    "correctIndex": 2,
    "note": "Intentional withholding of prescribed analgesia to cause suffering. This meets the deliberate harm threshold; urgent protective action and regulatory escalation are indicated."
  },
  {
    "text": "A healthcare assistant took a humiliating photo of a sedated patient and shared it in a group chat with derogatory comments. The patient later learned of the photo and was distressed.",
    "options": [
      "Issue a written apology, require structured social-media and confidentiality training, and place a note on file.",
      "Dismiss for abuse and humiliation, notify the staff’s management and issue a public apology.",
      "Impose a one-week suspension without a full investigation as a deterrent measure only.",
      "Redeploy for three months with informal coaching and then close the case without further action."
    ],
    "correctIndex": 1,
    "note": "Deliberate humiliation of a vulnerable patient. Gross misconduct with safeguarding and regulatory implications."
  },
  {
    "text": "An on-call doctor, angered by a relative’s complaint, deliberately delayed prescribing antiemetics for the relative’s family member, stating privately that 'they can wait.' The patient vomited repeatedly and aspirated, requiring critical care.",
    "options": [
      "Initiate dismissal proceedings and refer to the authorities.",
      "Issue a formal warning, mandate customer-care and professionalism training, and monitor for recurrence.",
      "Arrange mediation with the family and return to normal duties without disciplinary record.",
      "Refer to occupational health only and take no further conduct action."
    ],
    "correctIndex": 0,
    "note": "Malicious withholding of treatment with intent to harm. Immediate disciplinary and regulatory pathways are required."
  },
  {
    "text": "A night registrar made multiple prescribing slips. Occupational health later confirmed severe undiagnosed obstructive sleep apnoea causing microsleeps. This was previously unknown to the registrar and team.",
    "options": [
      "Dismiss for incompetence based on repeated errors despite the subsequent health explanation.",
      "Refer to occupational health, place temporary practice restrictions, and monitor treatment response.",
      "Take no action, assuming the medical condition fully explains the errors and requires no follow-up.",
      "Report the matter to police for potential endangerment of patients despite lack of intent."
    ],
    "correctIndex": 1,
    "note": "Previously unknown medical condition plausibly contributed. Prioritise health management and reasonable adjustments over punishment."
  },
  {
    "text": "An insulin-dependent surgeon felt early hypoglycaemia but continued with an elective list without informing colleagues. Intra-op judgement errors occurred. The surgeon had been advised to stop and treat if symptoms arose.",
    "options": [
      "Suspend from clinical duties and assess fitness to practice.",
      "Provide only a verbal reminder about the agreed safety plan and no further steps.",
      "Take no action provided no lasting harm occurred and the list finished uneventfully.",
      "Dismiss immediately without any investigation or health assessment."
    ],
    "correctIndex": 0,
    "note": "Known medical condition with explicit safety plan ignored. This is an unacceptable risk; restriction and regulatory involvement are warranted."
  },
  {
    "text": "A paramedic attended duty after using cocaine recreationally the previous night and showed impaired judgement on scene. This is the first recorded incident; the paramedic admits use.",
    "options": [
      "Suspend immediately.",
      "Allow continued practice with weekly supervision meetings but no formal restriction.",
      "Issue a written apology to the patient, file a note, and close the case.",
      "Grant sick leave and take no further steps, monitoring or referrals."
    ],
    "correctIndex": 0,
    "note": "Acute substance misuse with patient-safety impact. Urgent protective measures and regulatory notification are required."
  },
  {
    "text": "A nurse administered insulin without a second independent check despite a clear, workable, routinely used double-check protocol. The dose was tenfold and the patient required ICU.",
    "options": [
      "Give a verbal reminder citing workload pressure and make no formal record.",
      "Refer to occupational health only without any investigatory or competency action.",
      "Take no action on the basis that errors occur in busy settings.",
      "Suspend and refer to pending investigation for unacceptable protocol violation."
    ],
    "correctIndex": 3,
    "note": "Protocol existed, was accessible, and in routine use. The nurse departed from it and took an unacceptable risk."
  },
  {
    "text": "During a busy take, a junior doctor skipped the allergy check documented in an available admission protocol. An antibiotic on the red-banner list was given and caused anaphylaxis, from which the patient recovered.",
    "options": [
      "Offer resilience training with no formal record or practice restriction.",
      "Take no action since the patient recovered and the event was brief.",
      "Issue a formal performance plan with restriction from prescribing pending training.",
      "Dismiss immediately without an investigation or remediation plan."
    ],
    "correctIndex": 2,
    "note": "Clear departure from a known, workable protocol with high risk. Proportionate restriction and formal management are appropriate."
  },
  {
    "text": "A theatre lead insisted on skipping the WHO 'time-out' to save time. No equipment failure or ambiguity existed. Wrong implant selection was narrowly averted by a scrub nurse.",
    "options": [
      "Give a simple verbal nudge to use the checklist in future and leave it at that.",
      "Deliver team training only and take no individual action against the lead.",
      "Suspend pending investigation, initiate disciplinary action, and report to the relevant regulator.",
      "Quietly rotate the lead to another list without documentation or follow-up."
    ],
    "correctIndex": 2,
    "note": "Knowingly ignoring a core safety checklist constitutes unacceptable risk. Suspension and formal action are justified."
  },
  {
    "text": "In a remote clinic with no paediatric airway kit, a GP used an improvised airway maneuver to maintain a child’s airway while waiting for retrieval. The local guideline covered adult equipment only.",
    "options": [
      "Start disciplinary action for not following a non-existent paediatric protocol despite the emergency.",
      "No individual sanction; document learning, update protocols, and arrange targeted training.",
      "Report to the GMC for an alleged scope-of-practice breach despite lack of clear guidance.",
      "Impose two weeks of mandatory leave without any investigation or debrief."
    ],
    "correctIndex": 1,
    "note": "Protocols were inadequate for the context. A reasonable peer may have acted similarly. Address system gaps and provide support."
  },
  {
    "text": "After a major EHR update, the allergy banner displayed in a collapsed panel. Several clinicians missed it in the first 48 hours. A pharmacist caught a near-miss; one junior had already prescribed a contraindicated drug.",
    "options": [
      "Treat as a system design and rollout failure; issue an urgent safety notice, add interim checks, and train staff.",
      "Suspend the junior prescriber involved despite the recent system change.",
      "Do nothing since the pharmacist caught the issue and no harm occurred.",
      "Issue final written warnings to all staff who missed the banner during rollout."
    ],
    "correctIndex": 0,
    "note": "Protocol visibility was impaired and not in routine use post-change. A peer could reasonably miss it; fix the system and brief teams."
  },
  {
    "text": "A community midwife chose home monitoring over hospital admission for borderline pre-eclampsia in line with an ambiguous local pathway that lacks clear thresholds. Senior review later disagreed.",
    "options": [
      "Take immediate disciplinary action for unsafe decision-making despite pathway ambiguity.",
      "No individual punishment, update training, and set a senior-review trigger until fixed.",
      "Refer to the NMC automatically without local review or learning.",
      "Ignore the case entirely because the baby was delivered safely and there was no harm."
    ],
    "correctIndex": 1,
    "note": "Where guidance is ambiguous, the Substitution Test often indicates peers might act similarly. Prioritise pathway clarity and support."
  },
  {
    "text": "Two wards used different versions of the sepsis protocol because the intranet link pointed to an old PDF. A nurse followed the outdated bundle and escalation was delayed.",
    "options": [
      "Give a final written warning to the nurse despite the outdated link.",
      "Treat as system failure and provide supportive training to the staff involved.",
      "Suspend the ward sister for poor oversight without addressing document control.",
      "Report the nurse to the NMC for a protocol breach despite the intranet error."
    ],
    "correctIndex": 1,
    "note": "Version control failure. Focus on system correction, communication, and non-punitive education."
  },
  {
    "text": "Label printers intermittently swapped patient identifiers when the network dropped. Despite usual bedside checks, one mislabelled sample went unnoticed and a transfusion was delayed.",
    "options": [
      "Discipline the phlebotomist for not double-checking despite the device fault.",
      "Take no action provided no harm occurred and routine checks continue.",
      "Retrain only the night shift involved without addressing the technology issue.",
      "Escalate as a system defect, pause affected devices and implement manual verification."
    ],
    "correctIndex": 3,
    "note": "Latent IT failure contributed. Address the technology and process; avoid blame while reinforcing interim safety checks."
  },
  {
    "text": "On a night with multiple emergencies, staffing fell to 50% of the safe roster. Routine observations were missed and a patient deteriorated unnoticed for an hour.",
    "options": [
      "Write up the nurse in charge for negligence.",
      "Treat as a staffing and workload system failure.",
      "Suspend all staff on duty pending investigation.",
      "Consider corrective training to avoid repeating the same mistake."
    ],
    "correctIndex": 1,
    "note": "Latent system conditions and workload led to missed care. Focus on organisational fixes and staff support."
  }
]
